ogneyar/ArduinoProjects/Libraries/Миландр. Standard Peripherals Library/Libraries/SPL/MDR32FxQI/inc/MDR32FxQI_usb.h
/**
  ******************************************************************************
  * @file    MDR32FxQI_usb.h
  * @author  Milandr Application Team
  * @version V2.0.0i
  * @date    14/03/2022
  * @brief   This file contains all the functions prototypes for the USB
  *          firmware library.
  ******************************************************************************
  * <br><br>
  *
  * THE PRESENT FIRMWARE WHICH IS FOR GUIDANCE ONLY AIMS AT PROVIDING CUSTOMERS
  * WITH CODING INFORMATION REGARDING THEIR PRODUCTS IN ORDER FOR THEM TO SAVE
  * TIME. AS A RESULT, MILANDR SHALL NOT BE HELD LIABLE FOR ANY DIRECT, INDIRECT
  * OR CONSEQUENTIAL DAMAGES WITH RESPECT TO ANY CLAIMS ARISING
  * FROM THE CONTENT OF SUCH FIRMWARE AND/OR THE USE MADE BY CUSTOMERS OF THE
  * CODING INFORMATION CONTAINED HEREIN IN CONNECTION WITH THEIR PRODUCTS.
  *
  * <h2><center>&copy; COPYRIGHT 2022 Milandr</center></h2>
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MDR32FxQI_USB_H
#define __MDR32FxQI_USB_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "MDR32FxQI_config.h"

/** @addtogroup __MDR32FxQI_StdPeriph_Driver MDR32FxQI Standard Peripherial Driver
  * @{
  */

/** @addtogroup USB
  * @{
  */

/** @defgroup USB_Exported_Types USB Exported Types
  * @{
  */

/**
  * @brief EndPoints enumeration
  */
typedef enum
{
    USB_EP0  = 0,
    USB_EP1  = 1,
    USB_EP2  = 2,
    USB_EP3  = 3,
    Num_USB_EndPoints
} USB_EP_TypeDef;

#define IS_USB_ENDPOINT(ENDPOINT)       (((ENDPOINT) >= 0) && ((ENDPOINT) < Num_USB_EndPoints))

/**
  * @brief USB USBC1 Source
  */
typedef enum
{
    USB_C1HSIdiv1 = ((uint32_t)0x00),
    USB_C1HSIdiv2 = ((uint32_t)0x01),
    USB_C1HSEdiv1 = ((uint32_t)0x02),
    USB_C1HSEdiv2 = ((uint32_t)0x03)
} USB_C1_Source_TypeDef;

#define IS_USBC1_CLOCK_BRG(CLOCK)      (((CLOCK) >= 0) && ((CLOCK) <= 3))

/**
  * @brief USB PLLUSB Source
  */
typedef enum
{
    USB_PLLUSBMUL1  = ((uint32_t)0x00),
    USB_PLLUSBMUL2  = ((uint32_t)0x01),
    USB_PLLUSBMUL3  = ((uint32_t)0x02),
    USB_PLLUSBMUL4  = ((uint32_t)0x03),
    USB_PLLUSBMUL5  = ((uint32_t)0x04),
    USB_PLLUSBMUL6  = ((uint32_t)0x05),
    USB_PLLUSBMUL7  = ((uint32_t)0x06),
    USB_PLLUSBMUL8  = ((uint32_t)0x07),
    USB_PLLUSBMUL9  = ((uint32_t)0x08),
    USB_PLLUSBMUL10 = ((uint32_t)0x09),
    USB_PLLUSBMUL11 = ((uint32_t)0x0A),
    USB_PLLUSBMUL12 = ((uint32_t)0x0B),
    USB_PLLUSBMUL13 = ((uint32_t)0x0C),
    USB_PLLUSBMUL14 = ((uint32_t)0x0D),
    USB_PLLUSBMUL15 = ((uint32_t)0x0E),
    USB_PLLUSBMUL16 = ((uint32_t)0x0F)
} USB_PLL_Source_TypeDef;

#define IS_PLLUSBMUL(MUL)              (((MUL) >= 0) && ((MUL) < 16))


/**
  * @brief USB Clock Init Structure definition
  */
typedef struct
{
    USB_C1_Source_TypeDef USB_USBC1_Source; /*!< Specifies the source for USB_C1, if USB_C2 source is set to USB_C1.
                                                 This parameter is one of @ref USB_C1_Source_TypeDef values. */
    USB_PLL_Source_TypeDef USB_PLLUSBMUL;   /*!< Specifies the source for USB_C1, if USB_C2 source is set to USB_PLL.
                                                 This parameter is one of @ref USB_PLL_Source_TypeDef values. */
} USB_Clock_TypeDef;

/**
  * @brief USB version and revision
  */
typedef struct
{
    uint8_t USB_Version;  /*!< USB Version. */
    uint8_t USB_Revision; /*!< USB Revision. */
} USB_Version_TypeDef;

/** @} */ /* End of group USB_Exported_Types */


/** @defgroup USB_Exported_Constants USB Exported Constants
  * @{
  */

/** @defgroup USB_USBC2_Source USB USBC2 Source
  * @{
  */

#define USB_PLL                         ((uint32_t)0x00000004)

/** @} */ /* End of group USB_USBC2_Source */

/** @defgroup USB_Clock_Source USB Clock Source
  * @{
  */

#define USB_CLOCK_48MHz             ((uint32_t)48000000)

#define IS_USB_CLOCK(MUL,USBC1)     (((USBC1 == USB_C1HSIdiv1) && (((MUL + 1)* HSI_Value) == USB_CLOCK_48MHz))       || \
                                     ((USBC1 == USB_C1HSIdiv2) && (((MUL + 1)* (HSI_Value / 2)) == USB_CLOCK_48MHz)) || \
                                     ((USBC1 == USB_C1HSEdiv1) && (((MUL + 1)* HSE_Value) == USB_CLOCK_48MHz))       || \
                                     ((USBC1 == USB_C1HSEdiv2) && (((MUL + 1)* (HSE_Value / 2)) == USB_CLOCK_48MHz)))

/** @} */ /* End of group USB_Clock_Source */

/** @defgroup USB_HOST_REGS_Values USB_HOST Register Values
  * @{
  */

/** @defgroup USB_HSCR_Values USB_HSCR Values
  * @{
  */

#define USB_HSCR_HOST_MODE_Host         (uint32_t)(1 << USB_HSCR_HOST_MODE_Pos)
#define USB_HSCR_HOST_MODE_Device       (uint32_t)(1 << (USB_HSCR_HOST_MODE_Pos + 16))

#define USB_HSCR_RESET_CORE_Reset       (uint32_t)(1 << USB_HSCR_RESET_CORE_Pos)
#define USB_HSCR_RESET_CORE_Work        (uint32_t)(1 << (USB_HSCR_RESET_CORE_Pos + 16))

#define USB_HSCR_EN_TX_Set              (uint32_t)(1 << USB_HSCR_EN_TX_Pos)
#define USB_HSCR_EN_TX_Reset            (uint32_t)(1 << (USB_HSCR_EN_TX_Pos + 16))

#define USB_HSCR_EN_RX_Set              (uint32_t)(1 << USB_HSCR_EN_RX_Pos)
#define USB_HSCR_EN_RX_Reset            (uint32_t)(1 << (USB_HSCR_EN_RX_Pos + 16))

#define USB_HSCR_DP_PULLUP_Set          (uint32_t)(1 << USB_HSCR_DP_PULLUP_Pos)
#define USB_HSCR_DP_PULLUP_Reset        (uint32_t)(1 << (USB_HSCR_DP_PULLUP_Pos + 16))

#define USB_HSCR_DP_PULLDOWN_Set        (uint32_t)(1 << USB_HSCR_DP_PULLDOWN_Pos)
#define USB_HSCR_DP_PULLDOWN_Reset      (uint32_t)(1 << (USB_HSCR_DP_PULLDOWN_Pos + 16))

#define USB_HSCR_DM_PULLUP_Set          (uint32_t)(1 << USB_HSCR_DM_PULLUP_Pos)
#define USB_HSCR_DM_PULLUP_Reset        (uint32_t)(1 << (USB_HSCR_DM_PULLUP_Pos + 16))

#define USB_HSCR_DM_PULLDOWN_Set        (uint32_t)(1 << USB_HSCR_DM_PULLDOWN_Pos)
#define USB_HSCR_DM_PULLDOWN_Reset      (uint32_t)(1 << (USB_HSCR_DM_PULLDOWN_Pos + 16))

#define USB_HSCR_SET_MASK               (USB_HSCR_HOST_MODE_Host   | \
                                         USB_HSCR_RESET_CORE_Reset | \
                                         USB_HSCR_EN_TX_Set        | \
                                         USB_HSCR_EN_RX_Set        | \
                                         USB_HSCR_DP_PULLUP_Set    | \
                                         USB_HSCR_DP_PULLDOWN_Set  | \
                                         USB_HSCR_DM_PULLUP_Set    | \
                                         USB_HSCR_DM_PULLDOWN_Set)

#define USB_HSCR_RESET_MASK             (USB_HSCR_SET_MASK << 16)

#define IS_USB_HSCR_VALUE(VALUE)        ((((VALUE) & (~(USB_HSCR_SET_MASK | USB_HSCR_RESET_MASK))) == 0) && \
                                        ((((VALUE) & ((uint32_t)(VALUE)) >> 16)) == 0))
/** @} */ /* End of group USB_HSCR_Values */

/** @defgroup USB_HTXC_Values USB_HTXC Values
  * @{
  */

#define USB_HTXC_TREQ_Set               (uint32_t)(1 << USB_HTXC_TREQ_Pos)
#define USB_HTXC_TREQ_Reset             (uint32_t)(1 << (USB_HTXC_TREQ_Pos + 16))

#define USB_HTXC_SOFS_Set               (uint32_t)(1 << USB_HTXC_SOFS_Pos)
#define USB_HTXC_SOFS_Reset             (uint32_t)(1 << (USB_HTXC_SOFS_Pos + 16))

#define USB_HTXC_PREEN_Set              (uint32_t)(1 << USB_HTXC_PREEN_Pos)
#define USB_HTXC_PREEN_Reset            (uint32_t)(1 << (USB_HTXC_PREEN_Pos + 16))

#define USB_HTXC_ISOEN_Set              (uint32_t)(1 << USB_HTXC_ISOEN_Pos)
#define USB_HTXC_ISOEN_Reset            (uint32_t)(1 << (USB_HTXC_ISOEN_Pos + 16))

#define USB_HTXC_SET_MASK               (USB_HTXC_TREQ_Set  | \
                                         USB_HTXC_SOFS_Set  | \
                                         USB_HTXC_PREEN_Set | \
                                         USB_HTXC_ISOEN_Set)

#define USB_HTXC_RESET_MASK             (USB_HTXC_SET_MASK << 16)

