ogneyar/ArduinoProjects/Libraries/Миландр. Standard Peripherals Library/Libraries/SPL/MDR32FxQI/inc/MDR32FxQI_usb.h
/** @} */ /* End of group USB_HRXS_Values */

/** @defgroup USB_HRXCS_Values USB_HRXCS Values
  * @{
  */

#define USB_HRXCS_RXLS_Disconnect       (uint32_t)(0x00000000)
#define USB_HRXCS_RXLS_LowSpeed         (uint32_t)(0x00000001)
#define USB_HRXCS_RXLS_FullSpeed        (uint32_t)(0x00000002)

#define IS_USB_HRXCS_VALUE(VALUE)       (((VALUE) == USB_HRXCS_RXLS_Disconnect) || \
                                         ((VALUE) == USB_HRXCS_RXLS_LowSpeed)   || \
                                         ((VALUE) == USB_HRXCS_RXLS_FullSpeed))

/** @} */ /* End of group USB_HRXCS_Values */

#define IS_USB_HTXA_VALUE(VALUE)        ((VALUE)  < 0x00000080)
#define IS_USB_HTXE_VALUE(VALUE)        ((VALUE)  < 0x00000010)
#define IS_USB_HFN_VALUE(VALUE)         ((VALUE)  < 0x00000800)
#define IS_USB_HRXP_VALUE(VALUE)        ((VALUE)  < 0x00000010)
#define IS_USB_HRXA_VALUE(VALUE)        ((VALUE)  < 0x00000080)
#define IS_USB_HRXE_VALUE(VALUE)        ((VALUE)  < 0x00000010)
#define IS_USB_HSTM_VALUE(VALUE)        ((VALUE)  < 0x00000100)
#define IS_USB_HRXFD_VALUE(VALUE)       ((VALUE)  < 0x00000100)
#define IS_USB_HRXFDC_VALUE(VALUE)      ((VALUE)  < 0x00010000)
#define IS_USB_HRXFC_VALUE(VALUE)       ((VALUE) == 0x00000001)
#define IS_USB_HTXFD_VALUE(VALUE)       ((VALUE)  < 0x00000100)
#define IS_USB_HTXFC_VALUE(VALUE)       ((VALUE) == 0x00000001)

/** @} */ /* End of group USB_HOST_REGS_Values */

/** @defgroup USB_DEVICE_REGS_Values USB_DEVICE Register Values
  * @{
  */

/** @defgroup USB_SEPx_CTRL_Values USB_SEPx_CTRL Values
  * @{
  */

#define USB_SEPx_CTRL_EPEN_Enable           (uint32_t)(1 << USB_SEP_CTRL_EPEN_Pos)
#define USB_SEPx_CTRL_EPEN_Disable          (uint32_t)(1 << (USB_SEP_CTRL_EPEN_Pos + 16))

#define USB_SEPx_CTRL_EPRDY_Ready           (uint32_t)(1 << USB_SEP_CTRL_EPRDY_Pos)
#define USB_SEPx_CTRL_EPRDY_NotReady        (uint32_t)(1 << (USB_SEP_CTRL_EPRDY_Pos + 16))

#define USB_SEPx_CTRL_EPDATASEQ_Data1       (uint32_t)(1 << USB_SEP_CTRL_EPDATASEQ_Pos)
#define USB_SEPx_CTRL_EPDATASEQ_Data0       (uint32_t)(1 << (USB_SEP_CTRL_EPDATASEQ_Pos + 16))

#define USB_SEPx_CTRL_EPSSTALL_Reply        (uint32_t)(1 << USB_SEP_CTRL_EPSSTALL_Pos)
#define USB_SEPx_CTRL_EPSSTALL_NotReply     (uint32_t)(1 << (USB_SEP_CTRL_EPSSTALL_Pos + 16))

#define USB_SEPx_CTRL_EPISOEN_Set           (uint32_t)(1 << USB_SEP_CTRL_EPISOEN_Pos)
#define USB_SEPx_CTRL_EPISOEN_Reset         (uint32_t)(1 << (USB_SEP_CTRL_EPISOEN_Pos + 16))

#define USB_SEPx_CTRL_SET_MASK              (USB_SEPx_CTRL_EPEN_Enable     | \
                                             USB_SEPx_CTRL_EPRDY_Ready     | \
                                             USB_SEPx_CTRL_EPDATASEQ_Data1 | \
                                             USB_SEPx_CTRL_EPSSTALL_Reply  | \
                                             USB_SEPx_CTRL_EPISOEN_Set)

#define USB_SEPx_CTRL_RESET_MASK            (USB_SEPx_CTRL_SET_MASK << 16)

#define IS_USB_SEPx_CTRL_VALUE(VALUE)       ((((VALUE) & (~(USB_SEPx_CTRL_SET_MASK | USB_SEPx_CTRL_RESET_MASK))) == 0) && \
                                            ((((VALUE) & ((uint32_t)(VALUE)) >> 16)) == 0))

/** @} */ /* End of group USB_SEPx_CTRL_Values */

/** @defgroup USB_SEPx_STS_Values USB_SEPx_STS Values
  * @{
  */

#define USB_SEPx_STS_SCCRCERR_Set           (uint32_t)(1 << USB_SEP_STS_SCCRCERR_Pos)
#define USB_SEPx_STS_SCCRCERR_Reset         (uint32_t)(1 << (USB_SEP_STS_SCCRCERR_Pos + 16))

#define USB_SEPx_STS_SCBSERR_Set            (uint32_t)(1 << USB_SEP_STS_SCBSERR_Pos)
#define USB_SEPx_STS_SCBSERR_Reset          (uint32_t)(1 << (USB_SEP_STS_SCBSERR_Pos + 16))

#define USB_SEPx_STS_SCRXOF_Set             (uint32_t)(1 << USB_SEP_STS_SCRXOF_Pos)
#define USB_SEPx_STS_SCRXOF_Reset           (uint32_t)(1 << (USB_SEP_STS_SCRXOF_Pos + 16))

#define USB_SEPx_STS_SCRXTO_Set             (uint32_t)(1 << USB_SEP_STS_SCRXTO_Pos)
#define USB_SEPx_STS_SCRXTO_Reset           (uint32_t)(1 << (USB_SEP_STS_SCRXTO_Pos + 16))

#define USB_SEPx_STS_SCNAKSENT_Set          (uint32_t)(1 << USB_SEP_STS_SCNAKSENT_Pos)
#define USB_SEPx_STS_SCNAKSENT_Reset        (uint32_t)(1 << (USB_SEP_STS_SCNAKSENT_Pos + 16))

#define USB_SEPx_STS_SCSTALLSENT_Set        (uint32_t)(1 << USB_SEP_STS_SCSTALLSENT_Pos)
#define USB_SEPx_STS_SCSTALLSENT_Reset      (uint32_t)(1 << (USB_SEP_STS_SCSTALLSENT_Pos + 16))

#define USB_SEPx_STS_SCACKRXED_Set          (uint32_t)(1 << USB_SEP_STS_SCACKRXED_Pos)
#define USB_SEPx_STS_SCACKRXED_Reset        (uint32_t)(1 << (USB_SEP_STS_SCACKRXED_Pos + 16))

#define USB_SEPx_STS_SCDATASEQ_Data1        (uint32_t)(1 << USB_SEP_STS_SCDATASEQ_Pos)
#define USB_SEPx_STS_SCDATASEQ_Data0        (uint32_t)(1 << (USB_SEP_STS_SCDATASEQ_Pos + 16))

#define USB_SEPx_STS_SET_MASK               (USB_SEPx_STS_SCCRCERR_Set    | \
                                             USB_SEPx_STS_SCBSERR_Set     | \
                                             USB_SEPx_STS_SCRXOF_Set      | \
                                             USB_SEPx_STS_SCRXTO_Set      | \
                                             USB_SEPx_STS_SCSTALLSENT_Set | \
                                             USB_SEPx_STS_SCNAKSENT_Set   | \
                                             USB_SEPx_STS_SCACKRXED_Set   | \
                                             USB_SEPx_STS_SCDATASEQ_Data1)

#define USB_SEPx_STS_RESET_MASK             (USB_SEPx_STS_SET_MASK << 16)

#define IS_USB_SEPx_STS_VALUE(VALUE)        ((((VALUE) & (~(USB_SEPx_STS_SET_MASK | USB_SEPx_STS_RESET_MASK))) == 0) && \
                                            ((((VALUE) & ((uint32_t)(VALUE)) >> 16)) == 0))

/** @} */ /* End of group USB_SEPx_STS_Values */

/** @defgroup USB_SEPx_TS_Values USB_SEPx_TS Values
  * @{
  */

#define USB_SEPx_TS_SCTTYPE_Setup           (uint32_t)(0x00000000)
#define USB_SEPx_TS_SCTTYPE_In              (uint32_t)(0x00000001)
#define USB_SEPx_TS_SCTTYPE_Outdata         (uint32_t)(0x00000002)

#define USB_SEPx_TS_SCTTYPE_Msk             (uint32_t)(0x00000003)

#define IS_USB_SEPx_TS_VALUE(VALUE)         (((VALUE) == USB_SEPx_TS_SCTTYPE_Setup)   || \
                                             ((VALUE) == USB_SEPx_TS_SCTTYPE_In)      || \
                                             ((VALUE) == USB_SEPx_TS_SCTTYPE_Outdata))

