ogneyar/ArduinoProjects/Libraries/Миландр. Standard Peripherals Library/Libraries/SPL/MDR32FxQI/inc/MDR32FxQI_usb.h
/** @} */ /* End of group USB_SEPx_TS_Values */

/** @defgroup USB_SEPx_NTS_Values USB_SEPx_NTS Values
  * @{
  */

#define USB_SEPx_NTS_NTTTYPE_Setup          (uint32_t)(0x00000000)
#define USB_SEPx_NTS_NTTTYPE_In             (uint32_t)(0x00000001)
#define USB_SEPx_NTS_NTTTYPE_Outdata        (uint32_t)(0x00000002)

#define USB_SEPx_NTS_NTTTYPE_Msk            (uint32_t)(0x00000003)

#define IS_USB_SEPx_NTS_VALUE(VALUE)        (((VALUE) == USB_SEPx_NTS_NTTTYPE_Setup)   || \
                                             ((VALUE) == USB_SEPx_NTS_NTTTYPE_In)      || \
                                             ((VALUE) == USB_SEPx_NTS_NTTTYPE_Outdata))

/** @} */ /* End of group USB_SEPx_NTS_Values */

/** @defgroup USB_SC_Values USB_SC Values
  * @{
  */

#define USB_SC_SCGEN_Set                    (uint32_t)(1 << USB_SCGEN_Pos)
#define USB_SC_SCGEN_Reset                  (uint32_t)(1 << (USB_SCGEN_Pos + 16))

#define USB_SC_SCTXLS_DM_Set                (uint32_t)(1 << USB_SCTXLS_Pos)
#define USB_SC_SCTXLS_DM_Reset              (uint32_t)(1 << (USB_SCTXLS_Pos + 16))

#define USB_SC_SCTXLS_DP_Set                (uint32_t)(1 << (USB_SCTXLS_Pos + 1))
#define USB_SC_SCTXLS_DP_Reset              (uint32_t)(1 << (USB_SCTXLS_Pos + 16 + 1))

#define USB_SC_SCDC_Direct                  (uint32_t)(1 << USB_SCDC_Pos)
#define USB_SC_SCDC_Normal                  (uint32_t)(1 << (USB_SCDC_Pos + 16))

#define USB_SC_SCFSP_Full                   (uint32_t)(1 << USB_SCFSP_Pos)
#define USB_SC_SCFSP_Low                    (uint32_t)(1 << (USB_SCFSP_Pos + 16))

#define USB_SC_SCFSR_12Mb                   (uint32_t)(1 << USB_SCFSR_Pos)
#define USB_SC_SCFSR_1_5Mb                  (uint32_t)(1 << (USB_SCFSR_Pos + 16))

#define USB_SC_SET_MASK                     (USB_SC_SCGEN_Set     | \
                                             USB_SC_SCTXLS_DM_Set | \
                                             USB_SC_SCTXLS_DP_Set | \
                                             USB_SC_SCDC_Direct   | \
                                             USB_SC_SCFSP_Full    | \
                                             USB_SC_SCFSR_12Mb)

#define USB_SC_RESET_MASK                   (USB_SC_SET_MASK << 16)

#define IS_USB_SC_VALUE(VALUE)              ((((VALUE) & (~(USB_SC_SET_MASK | USB_SC_RESET_MASK))) == 0) && \
                                            ((((VALUE) & ((uint32_t)(VALUE)) >> 16)) == 0))

/** @} */ /* End of group USB_SC_Values */

/** @defgroup USB_SLS_Values USB_SLS Values
  * @{
  */

#define USB_SLS_SCRXLS_Reset                (uint32_t)(0x00000000)
#define USB_SLS_SCRXLS_LowSpeed             (uint32_t)(0x00000001)
#define USB_SLS_SCRXLS_FullSpeed            (uint32_t)(0x00000002)

#define IS_USB_SLS_VALUE(VALUE)             (((VALUE) == USB_SLS_SCRXLS_Reset)     || \
                                             ((VALUE) == USB_SLS_SCRXLS_LowSpeed)  || \
                                             ((VALUE) == USB_SLS_SCRXLS_FullSpeed))

/** @} */ /* End of group USB_SLS_Values */

/** @defgroup USB_SIS_Values USB_SIS Values
  * @{
  */

#define USB_SIS_SCTDONE_Set                 USB_SIS_SCTDONE
#define USB_SIS_SCRESUME_Set                USB_SIS_SCRESUME
#define USB_SIS_SCRESETEV_Set               USB_SIS_SCRESETEV
#define USB_SIS_SCSOFREC_Set                USB_SIS_SCSOFREC
#define USB_SIS_SCNAKSENT_Set               USB_SIS_SCNAKSENT

#define USB_SIS_Msk                         USB_SIS_SCTDONE_Set   | \
                                            USB_SIS_SCRESUME_Set  | \
                                            USB_SIS_SCRESETEV_Set | \
                                            USB_SIS_SCSOFREC_Set  | \
                                            USB_SIS_SCNAKSENT_Set

#define IS_USB_SIS_VALUE(VALUE)             (((VALUE) == USB_SIS_SCTDONE_Set)   || \
                                             ((VALUE) == USB_SIS_SCRESUME_Set)  || \
                                             ((VALUE) == USB_SIS_SCRESETEV_Set) || \
                                             ((VALUE) == USB_SIS_SCSOFREC_Set)  || \
                                             ((VALUE) == USB_SIS_SCNAKSENT_Set))

/** @} */ /* End of group USB_SIS_Values */

/** @defgroup USB_SIM_Values USB_SIM Values
  * @{
  */

#define USB_SIM_SCTDONEIE_Set               (uint32_t)(1 << USB_SIM_SCTDONEIE_Pos)
#define USB_SIM_SCTDONEIE_Reset             (uint32_t)(1 << (USB_SIM_SCTDONEIE_Pos + 16))

#define USB_SIM_SCRESUMEIE_Set              (uint32_t)(1 << USB_SIM_SCRESUMEIE_Pos)
#define USB_SIM_SCRESUMEIE_Reset            (uint32_t)(1 << (USB_SIM_SCRESUMEIE_Pos + 16))

#define USB_SIM_SCRESETEVIE_Set             (uint32_t)(1 << USB_SIM_SCRESETEVIE_Pos)
#define USB_SIM_SCRESETEVIE_Reset           (uint32_t)(1 << (USB_SIM_SCRESETEVIE_Pos + 16))

#define USB_SIM_SCSOFRECIE_Set              (uint32_t)(1 << USB_SIM_SCSOFRECIE_Pos)
#define USB_SIM_SCSOFRECIE_Reset            (uint32_t)(1 << (USB_SIM_SCSOFRECIE_Pos + 16))

#define USB_SIM_SCNAKSENTIE_Set             (uint32_t)(1 << USB_SIM_SCNAKSENTIE_Pos)
#define USB_SIM_SCNAKSENTIE_Reset           (uint32_t)(1 << (USB_SIM_SCNAKSENTIE_Pos + 16))

#define USB_SIM_SET_MASK                    (USB_SIM_SCTDONEIE_Set   | \
                                             USB_SIM_SCRESUMEIE_Set  | \
                                             USB_SIM_SCRESETEVIE_Set | \
                                             USB_SIM_SCSOFRECIE_Set  | \
                                             USB_SIM_SCNAKSENTIE_Set)

#define USB_SIM_RESET_MASK                  (USB_SIM_SET_MASK << 16)

#define IS_USB_SIM_VALUE(VALUE)             ((((VALUE) & (~(USB_SIM_SET_MASK | USB_SIM_RESET_MASK))) == 0) && \
                                             ((((VALUE) & ((uint32_t)(VALUE)) >> 16)) == 0))

/** @} */ /* End of group USB_SIM_Values */

#define IS_USB_SA_VALUE(VALUE)              ((VALUE)  < 0x00000080)
#define IS_USB_SFN_VALUE(VALUE)             ((VALUE)  < 0x00000800)
#define IS_USB_SEPx_RXFD_VALUE(VALUE)       ((VALUE)  < 0x00000100)
#define IS_USB_SEPx_RXFDC_VALUE(VALUE)      ((VALUE)  < 0x00010000)
#define IS_USB_SEPx_RXFC_VALUE(VALUE)       ((VALUE) == 0x00000001)
#define IS_USB_SEPx_TXFD_VALUE(VALUE)       ((VALUE)  < 0x00000100)
#define IS_USB_SEPx_TXFDC_VALUE(VALUE)      ((VALUE) == 0x00000001)

/** @} */ /* End of group USB_DEVICE_REGS_Values */

/** @} */ /* End of group USB_Exported_Constants */


